saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Maxim.MAX32660.1.1.2.pdsc
      <condition id="MAX32660 CMSIS-CORE">
         <description>Maxim MAX32660 Series devices and CMSIS-CORE</description>
         <require Cclass="CMSIS" Cgroup="CORE"/>
         <accept condition="MAX32660 Device"/>
         <require Cclass="Device" Cgroup="Startup"/>
      </condition>

      <condition id="Startup ARM">
         <description>Startup files for the Keil/ARMCC Toolchains</description>
         <require Tcompiler="ARMCC"/>
      </condition>

      <condition id="Startup GCC">
         <description>Startup files for the GNU C Toolchain</description>
         <require Tcompiler="GCC"/>
      </condition>

      <condition id="Startup IAR">
         <description>Startup files for the IAR Embedded Workbench Toolchain</description>
         <require Tcompiler="IAR"/>
      </condition>

      <condition id="MAX32660 CMSIS GPIO">
         <description>GPIO Interface Layer</description>
         <require condition="MAX32660 CMSIS-CORE"/>
      </condition>

      <condition id="MAX32660 CMSIS I2C">
         <description>I2C Master/Slave Interface</description>
         <require condition="MAX32660 CMSIS-CORE"/>
         <require Cclass="Peripherals" Cgroup="GPIO"/>
      </condition>

      <condition id="MAX32660 CMSIS I2S">
         <description>I2S Master/Slave Interface</description>
         <require condition="MAX32660 CMSIS-CORE"/>
         <require Cclass="Peripherals" Cgroup="GPIO"/>
         <require Cclass="Peripherals" Cgroup="DMA"/>
      </condition>

      <condition id="MAX32660 CMSIS DMA">
         <description>DMA</description>
         <require condition="MAX32660 CMSIS-CORE"/>
      </condition>

      <condition id="MAX32660 CMSIS RTC">
         <description>Real Time Clock</description>
         <require condition="MAX32660 CMSIS-CORE"/>
         <require Cclass="Peripherals" Cgroup="GPIO"/>
      </condition>

      <condition id="MAX32660 CMSIS Flash IAP">
         <description>In-Application Flash Programming</description>
         <require condition="MAX32660 CMSIS-CORE"/>
      </condition>

      <condition id="MAX32660 CMSIS SPI">
         <description>SPI Master/Slave Interface</description>
         <require condition="MAX32660 CMSIS-CORE"/>
         <require Cclass="Peripherals" Cgroup="GPIO"/>
      </condition>

      <condition id="MAX32660 CMSIS TIMER">
         <description>32 Timers</description>
         <require condition="MAX32660 CMSIS-CORE"/>
         <require Cclass="Peripherals" Cgroup="GPIO"/>
      </condition>

      <condition id="MAX32660 CMSIS WDT">
         <description>Watchdog Timer</description>
         <require condition="MAX32660 CMSIS-CORE"/>
      </condition>

      <condition id="MAX32660 CMSIS UART">
         <description>UART</description>
         <require condition="MAX32660 CMSIS-CORE"/>
         <require Cclass="Peripherals" Cgroup="GPIO"/>
      </condition>

      <condition id="MAX32660 BSP">
         <description>Board Support Package</description>
         <require condition="MAX32660 CMSIS-CORE"/>
         <require Cclass="Peripherals" Cgroup="GPIO"/>
         <require Cclass="Communications" Cgroup="SPI"/>
         <require Cclass="Communications" Cgroup="I2C"/>
         <require Cclass="Communications" Cgroup="UART"/>
      </condition>

   </conditions>

   <components>
      <component Cclass="Device" Cgroup="Startup" Cversion="1.1.2" condition="MAX32660 Device">
         <description>System Startup for Maxim MAX32660 Microcontroller</description>
         <RTE_Components_h>
               <!-- the following content goes into file 'RTE_Components.h' -->
               #define TARGET 32660   /* Target Device Part Number */
               #define TARGET_REV 0x4131 /* Target Device Revision Number */
         </RTE_Components_h>
         <files>
            <file category="include" name="Libraries/Device/Maxim/MAX32660/Include/"/>
            <file category="include" name="Libraries/MAX32660PeriphDriver/Include/"/>

            <!-- Keil/ARM startup specific files -->
            <file category="sourceAsm" attr="config" name="Libraries/Device/Maxim/MAX32660/Source/ARM/startup_max32660.s" version="1.1.2" condition="Startup ARM"/>

            <!-- GCC startup files -->
            <file category="sourceAsm" attr="config" name="Libraries/Device/Maxim/MAX32660/Source/GCC/startup_max32660.S" version="1.1.2" condition="Startup GCC"/>

            <!-- IAR Specific Startup Files -->
            <file category="sourceAsm" attr="config" name="Libraries/Device/Maxim/MAX32660/Source/IAR/startup_max32660.s" version="1.1.2" condition="Startup IAR"/>
            <file category="sourceC" attr="config" name="Libraries/Device/Maxim/MAX32660/Source/IAR/low_level_init.c" version="1.1.2" condition="Startup IAR"/>
            <file category="sourceAsm" attr="config" name="Libraries/Device/Maxim/MAX32660/Source/IAR/cmain.s" version="1.1.2" condition="Startup IAR"/>

            <!-- Shared startup files for all tools -->
            <file category="sourceC" attr="config" name="Libraries/Device/Maxim/MAX32660/Source/system_max32660.c" version="1.1.2" />
            <file category="sourceC" name="Libraries/MAX32660PeriphDriver/Source/nvic_table.c" version="1.1.2"/>
            <file category="header" name="Libraries/Device/Maxim/MAX32660/Include/max32660.h" version="1.1.2" />
            <file category="sourceC" name="Libraries/MAX32660PeriphDriver/Source/flc.c" version="1.1.2"/>
            <file category="sourceC" name="Libraries/MAX32660PeriphDriver/Source/icc.c" version="1.1.2"/>
            <file category="sourceC" name="Libraries/MAX32660PeriphDriver/Source/lp.c" version="1.1.2"/>
            <file category="header" attr="config" name="Libraries/MAX32660PeriphDriver/Include/mxc_config.h" version="1.1.2"/>
            <file category="sourceC" name="Libraries/MAX32660PeriphDriver/Source/mxc_assert.c" version="1.1.2"/>
            <file category="sourceC" name="Libraries/MAX32660PeriphDriver/Source/mxc_lock.c" version="1.1.2"/>
            <file category="sourceC" name="Libraries/MAX32660PeriphDriver/Source/mxc_sys.c" version="1.1.2"/>
            <file category="sourceC" name="Libraries/MAX32660PeriphDriver/Source/mxc_pins.c" version="1.1.2"/>
            <file category="sourceC" name="Libraries/MAX32660PeriphDriver/Source/mxc_delay.c" version="1.1.2"/>
         </files>
      </component>

      <component Cclass="Peripherals" Cgroup="GPIO" Cversion="1.1.2" condition="MAX32660 CMSIS GPIO">

         <description>GPIO</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32660PeriphDriver/Source/gpio.c" version="1.1.2"/>
         </files>
      </component>

      <component Cclass="Communications" Cgroup="I2C" Cversion="1.1.2" condition="MAX32660 CMSIS I2C">

         <description>I2C Master Interface</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32660PeriphDriver/Source/i2c.c" version="1.1.2"/>
         </files>
      </component>

      <component Cclass="Communications" Cgroup="I2S" Cversion="1.1.2" condition="MAX32660 CMSIS I2S">

         <description>I2S Master/Slave Interface</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32660PeriphDriver/Source/i2s.c" version="1.1.2"/>
         </files>
      </component>

      <component Cclass="Communications" Cgroup="SPI" Cversion="1.1.2" condition="MAX32660 CMSIS SPI">

         <description>SPI Master Interface</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32660PeriphDriver/Source/spi.c" version="1.1.2"/>
            <file category="sourceC" name="Libraries/MAX32660PeriphDriver/Source/spi17y.c" version="1.1.2"/>
            <file category="sourceC" name="Libraries/MAX32660PeriphDriver/Source/spimss.c" version="1.1.2"/>
         </files>
      </component>

      <component Cclass="Peripherals" Cgroup="DMA" Cversion="1.1.2" condition="MAX32660 CMSIS DMA">

         <description>DMA Engine</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32660PeriphDriver/Source/dma.c" version="1.1.2"/>
         </files>
      </component>

