saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Maxim.MAX32660.1.1.2.pdsc
      <component Cclass="Peripherals" Cgroup="RTC" Cversion="1.1.2" condition="MAX32660 CMSIS RTC">

         <description>Real Time Clock Interface</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32660PeriphDriver/Source/rtc.c" version="1.1.2"/>
         </files>
      </component>

      <component Cclass="Peripherals" Cgroup="Flash IAP" Cversion="1.1.2" condition="MAX32660 CMSIS Flash IAP">

         <description>Flash In-Application Programming Interface</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32660PeriphDriver/Source/flc.c" version="1.1.2"/>
         </files>
      </component>

      <component Cclass="Peripherals" Cgroup="Timers" Cversion="1.1.2" condition="MAX32660 CMSIS TIMER">

         <description>32/16 Bit Timers</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32660PeriphDriver/Source/tmr.c" version="1.1.2"/>
            <file category="sourceC" name="Libraries/MAX32660PeriphDriver/Source/tmr_utils.c" version="1.1.2"/>
         </files>
      </component>

      <component Cclass="Peripherals" Cgroup="WDT" Cversion="1.1.2" condition="MAX32660 CMSIS WDT">

         <description>Watchdog Timer</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32660PeriphDriver/Source/wdt.c" version="1.1.2"/>
         </files>
      </component>

      <component Cclass="Communications" Cgroup="UART" Cversion="1.1.2" condition="MAX32660 CMSIS UART">

         <description>UART Interface</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32660PeriphDriver/Source/uart.c" version="1.1.2"/>
         </files>

      </component>

      <bundle Cbundle="MAX32660 EVKIT Board Support" Cclass="BSP" Cversion="1.1.2">
         <description>MAX32660 Evaluation Kit Board Support Package</description>
         <doc>Documents/MAX32660_User_Guide.pdf</doc>
         <component Cgroup="Board Support" condition="MAX32660 BSP">
            <description>MAX32660 Evaluation Kit Board Setup</description>
            <RTE_Components_h>
               #define BOARD EvKit_V1 /* Target Board */
            </RTE_Components_h>
            <files>
               <file category="doc" name="https://datasheets.maximintegrated.com/en/ds/MAX32660EVKIT.pdf"/>
               <file category="include" name="Boards/Maxim/MAX32660_EVKIT/Common/EvKit_V1/Include/"/>
               <file category="include" name="Boards/Maxim/MAX32660_EVKIT/Common/Include/"/>
               <file category="sourceC" name="Boards/Maxim/MAX32660_EVKIT/Common/EvKit_V1/Source/board.c" version="1.1.2"/>
               <file category="sourceC" name="Boards/Maxim/MAX32660_EVKIT/Common/Source/stdio.c" version="1.1.2"/>
               <file category="sourceC" name="Boards/Maxim/MAX32660_EVKIT/Common/Source/pb.c" version="1.1.2"/>
               <file category="sourceC" name="Boards/Maxim/MAX32660_EVKIT/Common/Source/led.c" version="1.1.2"/>
            </files>

         </component>

      </bundle>

   </components>

</package>
